import 'package:muslim_app/models/ahadiths.dart';
import 'package:muslim_app/models/data_aklak.dart';
import 'package:muslim_app/models/sera_nabwe.dart';

import 'data_hadith.dart';
import 'lesson.dart';

class lesson_data {
  
  static const List<Map<String, String>> categories = [
    {
      'id': 'hadith',
      'name': 'الأحاديث',
      'description': 'كل ما يخص الأحاديث النبوية الشريفة',
      'icon': 'menu_book',
    },
    {
      'id': 'prayer',
      'name': 'كيفية الصلاة',
      'description': 'تعليمات وأحاديث تتعلق بكيفية الصلاة والوضوء',
      'icon': 'prayer',
    },

    {
      'id': 'wudu',
      'name': 'كيفية الوضوء',
      'description': 'تعليمات وأحاديث تتعلق بكيفية الوضوء الصحيح.',
      'icon': 'water',
    },
    {
      'id': 'arkan_islam',
      'name': 'أركان الإسلام',
      'description':
          'أحاديث تتعلق بأركان الإسلام الخمسة: الشهادة، الصلاة، الزكاة، الصوم، الحج.',
      'icon': 'pillars',
    },
    {
      'id': 'sira',
      'name': 'السيرة النبوية',
      'description': 'أحاديث وقصص تتعلق بحياة النبي محمد صلى الله عليه وسلم.',
      'icon': 'history',
    },
    {
      'id': 'adab',
      'name': 'الآداب والأخلاق',
      'description': 'أحاديث تتعلق بالآداب الإسلامية والأخلاق الحميدة.',
      'icon': 'morality',
    },
  ];

  static const List<Map<String, String>> sub_categories = [
    {
      'id': 'aqeedah',
      'name': 'العقيدة',
      'parentId': 'hadith',
      'description':
          'أحاديث تتعلق بالإيمان بالله وملائكته وكتبه ورسله واليوم الآخر والقدر.',
    },
    {
      'id': 'ibadat',
      'name': 'العبادات',
      'parentId': 'hadith',
      'description':
          'أحاديث تتعلق بالصلاة والصيام والزكاة والحج وغيرها من العبادات.',
    },
    {
      'id': 'how_to_pray',
      'name': 'كيفية الصلاة',
      'parentId': 'prayer',
      'description': 'تعليمات وأحاديث تتعلق بكيفية أداء الصلاة.',
    },
    {
      'id': 'how_to_wudu',
      'name': 'كيفية الوضوء',
      'parentId': 'wudu',
      'description': 'تعليمات وأحاديث تتعلق بكيفية الوضوء الصحيح.',
    },
    {
      'id': 'arkan_islam',
      'name': 'أركان الإسلام',
      'parentId': 'arkan_islam',
      'description':
          'أحاديث تتعلق بأركان الإسلام الخمسة: الشهادة، الصلاة، الزكاة، الصوم، الحج.',
    },
    {
      'id': 'sira_nabawiya',
      'name': 'السيرة النبوية',
      'parentId': 'sira',
      'description': 'أحاديث وقصص تتعلق بحياة النبي محمد صلى الله عليه وسلم.',
    },
    {
      'id': 'adab_akhlaq',
      'name': 'الآداب والأخلاق',
      'parentId': 'adab',
      'description': 'أحاديث تتعلق بالآداب الإسلامية والأخلاق الحميدة.',
    },
  ];

  static List<lesson> lessons = [
    lesson(
      title: 'حديث الإيمان',
      description: 'الحديث الذي يتحدث عن أركان الإيمان.',
      content:
          'قال رسول الله صلى الله عليه وسلم: "الإيمان أن تؤمن بالله وملائكته وكتبه ورسله واليوم الآخر وتؤمن بالقدر خيره وشره"'
          '$hadith.',
      category: 'hadith',
      subCategory: 'aqeedah',
      tags: ['إيمان', 'عقيدة'], id: '1', subCategories: 'hadeth',
    ),
    lesson(id:'1',
      title: 'حديث الصلاة',
      description: 'الحديث الذي يوضح فضل الصلاة.',
      content:
          'قال رسول الله صلى الله عليه وسلم: "الصلاة عماد الدين، من أقامها فقد أقام الدين، ومن هدمها فقد هدم الدين".',
      category: 'hadith',
      subCategory: 'ibadat',
      tags: ['صلاة', 'عبادة'], subCategories: 'hadeth',
    ),
    lesson(
      title: 'تعليمات الصلاة',
      description: 'خطوات أداء الصلاة بشكل صحيح.',
      content: '1. استقبال القبلة.'
          '\n2. النية.'
          '\n3. تكبيرة الإحرام.'
          '\n4.  قراءة الفاتحة وسورة قصيرة'
          '\n5..  الركوع الانحناء بحيث يكون الظهر مستويًا، مع وضع اليدين على الركبتين.قول سبحان ربي العظيم ثلاث مرات.'
          '\n6. لرفع من الركوعالاعتدال في الوقوف وقول سمع الله لمن حمده ثم قول ربنا ولك الحمد'
          '\n7.السجودالنزول للسجود بحيث تلامس الجبهة، الأنف، الكفّان، الركبتان، وأطراف أصابع القدمين الأرض و قول سبحان ربي الأعلى ثلاث مرات.'
          '\n8. الجلوس بين السجدتين الجلوس معتدلًا وقول رب اغفر لي، رب اغفر لي.'
          '\n9. السجود الثاني تكرار نفس خطوات السجود الأول.'
          '\n10.القيام للركعة الثانية تكرار ما سبق من قراءة الفاتحة، السورة، الركوع، والجلوس.'
          '\n11.التشهد الأول (في الصلاة الثلاثية والرباعية)بعد السجدة الثانية في الركعة الثانية، الجلوس وقول:"التحيات لله والصلوات والطيبات، السلام عليك أيها النبي ورحمة الله وبركاته، السلام علينا وعلى عباد الله الصالحين، أشهد أن لا إله إلا الله وأشهد أن محمدًا عبده ورسوله"إذا كانت الصلاة ثنائية (الفجر)، يتم إكمال التشهد والصلاة الإبراهيمية ثم التسليم .'
          '\n12. الركعتان الأخيرتان (في الصلاة الثلاثية والرباعية)القيام وأداء الركعتين بنفس الطريقة لكن بقراءة الفاتحة فقط بدون سورة.'
          '\n13.التشهد الأخيربعد الركعة الثالثة في المغرب أو الرابعة في الظهر، العصر، والعشاء، يتم تكرار التشهد السابق، ثم إضافة الصلاة الإبراهيمية:"اللهم صلِّ على محمد وعلى آل محمد كما صليت على إبراهيم وعلى آل إبراهيم إنك حميد مجيد، وبارك على محمد وعلى آل محمد كما باركت على إبراهيم وعلى آل إبراهيم إنك حميد مجيد"..'
          '\n14. التسليمالالتفات يمينًا وقول "السلام عليكم ورحمة الله".الالتفات يسارًا وقول "السلام عليكم ورحمة الله"..',
      category: 'prayer',
      subCategory: 'how_to_pray',
      tags: ['صلاة', 'تعليمات'], id: '2', subCategories: 'hadeth',
    ),
    lesson(
      title: 'تعليمات الوضوء',
      description: 'خطوات الوضوء بشكل صحيح.',
      content: ''
          '1. النية.'
          '\n2. غسل الكفين : ثلاث مرات.'
          '\n3. المضمضة:ادخال الماء في الفم و تحريكه ,ثم اخراجه ,ثلاث مرات . '
          '\n4 والاستنشاق :ادخال الماء في الأنف و استنشاقه ثم اخراجه ثلاث مرا .'
          '\n5. غسل الوجه: من منبت الشعر إلى أسفل الذقن، ومن الأذن إلى الأذن، ثلاث مرات.'
          '\n6.غسل اليدين إلى المرفقين: بدءًا من اليد اليمنى، ثم اليسرى، ثلاث مرات لكل يد'
          '\n7. مسح الرأس: مرة واحدة، تمرير اليد المبللة من مقدمة الرأس إلى الخلف ثم إعادتها للأمام.'
          '\n8.مسح الأذنين: إدخال السبابتين في الأذنين، ومسحهما بالإبهامين من الخارج، مرة واحدة'
          '\n9. غسل الرجلين إلى الكعبين: بدءًا من اليمنى، ثم اليسرى، ثلاث مرات لكل رجل.'
          '      \n10.قول الشهادة بعد الوضوء:أشهد أن لا إله إلا الله وحده لا شريك له، وأشهد أن محمدًا عبده ورسوله. اللهم اجعلني من التوابين، واجعلني من المتطهرين',
      category: 'wudu',
      subCategory: 'how_to_wudu',
      tags: ['وضوء', 'تعليمات'], id: '3', subCategories: 'hadeth',
    ),
    lesson(
      title: 'حديث أركان الإسلام',
      description: 'الحديث الذي يتحدث عن أركان الإسلام.',
      content:
          'قال رسول الله صلى الله عليه وسلم: "بني الإسلام على خمس: شهادة أن لا إله إلا الله وأن محمدًا رسول الله، وإقام الصلاة، وإيتاء الزكاة، وصوم رمضان، وحج البيت لمن استطاع اليه سبيلا".',
      category: 'arkan_islam',
      tags: ['إسلام', 'أركان'], id: '4', subCategory: 'kk', subCategories: 'hadeth',
    ),
    lesson(
      title: 'حديث الهجرة',
      description: 'الحديث الذي يتحدث عن هجرة النبي صلى الله عليه وسلم.',
      content:
          'قال رسول الله صلى الله عليه وسلم: "لا هجرة بعد الفتح، ولكن جهاد ونية'
          '$sera_nabwe',
      category: 'sira',
      subCategory: 'sira_nabawiya',
      tags: ['سيرة', 'هجرة'], id: '5', subCategories: 'hadeth',
    ),
    lesson(
      title: 'حديث الحياء',
      description: 'الحديث الذي يتحدث عن الحياء.',
      content: 'قال رسول الله صلى الله عليه وسلم: "الحياء لا يأتي إلا بخير"'
          '${aklak}.',
      category: 'adab',
      subCategory: 'adab_akhlaq',
      tags: ['حياء', 'أخلاق'], id: '6', subCategories: 'hadeth',
    ),
  ];
}
