import 'package:flutter/material.dart';
import '../widget/zikr_card.dart';

class azkar_screen extends StatefulWidget {
  const azkar_screen({super.key});

  @override
  State<azkar_screen> createState() => _azkar_screen_state();
}

class _azkar_screen_state extends State<azkar_screen>
    with SingleTickerProviderStateMixin {
  bool _is_morning_azkar = true;
  late TabController _tab_controller;

  @override
  void initState() {
    super.initState();
    _tab_controller = TabController(length: 2, vsync: this);
    _tab_controller.addListener(() {
      setState(() {
        _is_morning_azkar = _tab_controller.index == 0;
      });
    });
  }

  @override
  void dispose() {
    _tab_controller.dispose();
    super.dispose();
  }

  final List<Map<String, dynamic>> _morning_azkar = [
    {
      'zikr':
      'أَصْبَحْنَا وَأَصْبَحَ الْمُلْكُ لِلَّهِ، وَالْحَمْدُ لِلَّهِ، لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ',
      'repeat': 1,
      'benefit': 'من قالها حين يصبح أجير من الجن حتى يمسى',
    },
    {
      'zikr':
      'اللَّهُمَّ بِكَ أَصْبَحْنَا، وَبِكَ أَمْسَيْنَا، وَبِكَ نَحْيَا، وَبِكَ نَمُوتُ، وَإِلَيْكَ النُّشُورُ',
      'repeat': 1,
      'benefit': 'من أذكار الصباح المستحبة',
    },
    {
      'zikr': 'سُبْحَانَ اللَّهِ وَبِحَمْدِهِ',
      'repeat': 100,
      'benefit': 'حُطَّتْ خَطَايَاهُ وَإِنْ كَانَتْ مِثْلَ زَبَدِ الْبَحْرِ',
    },
    {
      "zikr":
      "الحَمدُ للَّه وَحدهُ، والصَّلاة والسَّلامُ على مَن لا نَبيَّ بَعدهُ.",
      "repeat": 1,
      "benefit": "الثناء على الله والصلاة على النبي محمد."
    },
    {
      "zikr": "أَعُوذُ بِاللَّهِ مِنْ الشَّيْطَانِ الرَّجِيمِ",
      "repeat": 1,
      "benefit": "الاستعاذة من الشيطان الرجيم."
    },
    {
      "zikr": "بسم اللَّه الرَّحمَن الرَّحيم",
      "repeat": 1,
      "benefit": "البدء بذكر الله."
    },
    {
      "zikr":
      "اللَّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ",
      "repeat": 1,
      "benefit": "قراءة آية الكرسي."
    },
    {
      "zikr":
      "قُلْ هُوَ ٱللَّهُ أَحَدٌ، ٱللَّهُ ٱلصَّمَدُ، لَمْ يَلِدْ وَلَمْ يُولَدْ، وَلَمْ يَكُن لَّهُۥ كُفُوًا أَحَدٌۢ",
      "repeat": 3,
      "benefit": "قراءة سورة الإخلاص."
    },
    {
      "zikr":
      "قُلْ أَعُوذُ بِرَبِّ ٱلْفَلَقِ، مِن شَرِّ مَا خَلَقَ، وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ، وَمِن شَرِّ ٱلنَّفَّٰثَٰتِ فِى ٱلْعُقَدِ، وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ",
      "repeat": 3,
      "benefit": "قراءة سورة الفلق."
    },
    {
      "zikr":
      "قُلْ أَعُوذُ بِرَبِّ ٱلنَّاسِ، مَلِكِ ٱلنَّاسِ، إِلَٰهِ ٱلنَّاسِ، مِن شَرِّ ٱلْوَسْوَاسِ ٱلْخَنَّاسِ، ٱلَّذِى يُوَسْوِسُ فِى صُدُورِ ٱلنَّاسِ، مِنَ ٱلْجِنَّةِ وَٱلنَّاسِ",
      "repeat": 3,
      "benefit": "قراءة سورة الناس."
    },
    {
      "zikr":
      "أَصْـبَحْنا وَأَصْـبَحَ المُـلْكُ للَّه وَالحَمدُ للَّه ، لا إلهَ إلاّ اللَّه وَحدَهُ لا شَريكَ لهُ ، لهُ المُـلكُ ولهُ الحَمْـد، وهُوَ على كلّ شَيءٍ قدير ، رَبِّ أسْـأَلُـكَ خَـيرَ ما في هـذا اليوم وَخَـيرَ ما بَعْـدَه ، وَأَعـوذُ بِكَ مِنْ شَـرِّ ما في هـذا اليوم وَشَرِّ ما بَعْـدَه، رَبِّ أَعـوذُ بِكَ مِنَ الْكَسَـلِ وَسـوءِ الْكِـبَر ، رَبِّ أَعـوذُ بِكَ مِنْ عَـذابٍ في النّـارِ وَعَـذابٍ في القَـبْر.",
      "repeat": 1,
      "benefit": "دعاء الصباح."
    },
    {
      "zikr":
      "اللّهـمَّ أَنْتَ رَبِّـي لا إلهَ إلاّ أَنْتَ، خَلَقْتَنـي وَأَنا عَبْـدُك، وَأَنا عَلـى عَهْـدِكَ وَوَعْـدِكَ ما اسْتَـطَعْـت، أَعـوذُ بِكَ مِنْ شَـرِّ ما صَنَـعْت، أَبـوءُ لَـكَ بِنِعْـمَتِـكَ عَلَـيَّ، وَأَبـوءُ بِذَنْـبي فَاغْفـِرْ لي، فَإِنَّـهُ لا يَغْـفِرُ الذُّنـوبَ إِلَّا أَنْتَ.",
      "repeat": 1,
      "benefit": "دعاء الاستغفار."
    },
    {
      "zikr":
      "رَضيـتُ بِاللَّه رَبَّـاً، وَبِالإسْلامِ ديـناً، وَبِمُحَـمَّدٍ صلَّى اللَّه عليه وسلََّم نَبِيّـاً.",
      "repeat": 3,
      "benefit": "الرضا بالله ربًا وبالإسلام دينًا وبمحمد نبيًا."
    },
    {
      "zikr":
      "اللّهُـمَّ إِنِّـي أَصْبَـحْتُ أُشْـهِدُك، وَأُشْـهِدُ حَمَلَـةَ عَـرْشِـك، وَمَلَائِكَتَكَ وَجَمـيعَ خَلْـقِك، أَنَّـكَ أَنْـتَ اللهُ لا إلهَ إلاّ أَنْـتَ وَحْـدَكَ لا شَريكَ لَـك، وَأَنَّ ُ مُحَمّـداً عَبْـدُكَ وَرَسـولُـك.",
      "repeat": 4,
      "benefit": "الشهادة لله ورسوله."
    },
    {
      "zikr":
      "اللّهُـمَّ ما أ_صْبَـحَ بي مِـنْ نِعْـمَةٍ، أَو بِأَحَـدٍ مِـنْ خَلْـقِك، فَمِـنْكَ وَحْـدَكَ لا شريكَ لَـك، فَلَـكَ الْحَمْـدُ وَلَـكَ الشُّكْـر.",
      "repeat": 1,
      "benefit": "الشكر على النعم."
    },
    {
      "zikr":
      "حَسْبِـيَ اللَّه لا إلهَ إلاّ هُوَ، عَلَـيهِ تَوَكَّـلتُ وَهُوَ رَبُّ العَرْشِ العَظـيم.",
      "repeat": 7,
      "benefit": "التوكل على الله."
    },
    {
      "zikr":
      "بِسـمِ اللَّه الذي لا يَضُـرُّ مَعَ اسمِـهِ شَيءٌ في الأرْضِ وَلا في السّمـاءِ، وَهـوَ السّمـيعُ العَلـيم.",
      "repeat": 3,
      "benefit": "الاستعاذة من الشرور."
    },
    {
      "zikr":
      "اللّهُـمَّ بِكَ أ_صْـبَحْنا، وَبِكَ أَمْسَـينا، وَبِكَ نَحْـيا، وَبِكَ نَمُـوتُ وَإِلَـيْكَ النُّـشُور.",
      "repeat": 1,
      "benefit": "الدعاء بالحياة والموت لله."
    },
    {
      "zikr":
      "أَصْبَـحْـنا عَلَى فِطْرَةِ الإسْلاَمِ، وَعَلَى كَلِمَةِ الإِخْلاَصِ، وَعَلَى دِينِ نَبِيِّنَا مُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، وَعَلَى مِلَّةِ أَبِينَا إبْرَاهِيمَ، حَنِيفاً مُسْلِماً وَمَا كَانَ مِنَ المُشْرِكِينَ.",
      "repeat": 1,
      "benefit": "الدعاء بالفطرة الإسلامية."
    },
    {
      "zikr":
      "سُبْحـانَ اللَّه وَبِحَمْـدِهِ عَدَدَ خَلْـقِه، وَرِضـا نَفْسِـه، وَزِنَـةَ عَـرْشِـه، وَمِـدادَ كَلِمـاتِه.",
      "repeat": 3,
      "benefit": "التسبيح بحمد الله."
    },
    {
      "zikr":
      "اللّهُـمَّ عافِـني في بَدَنـي، اللّهُـمَّ عافِـني في سَمْـعي، اللّهُـمَّ عافِـني في بَصَـري، لا إلهَ إلاّ أَنْـتَ، اللّهُـمَّ إِنّـي أَعـوذُ بِكَ مِنَ الْكُـفر وَالفَـقْر، وَأَعـوذُ بِكَ مِنْ عَذابِ القَـبْر، لا إلهَ إلاّ أَنْـتَ.",
      "repeat": 3,
      "benefit": "الدعاء بالعافية."
    },
    {
      "zikr":
      "اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في الدُّنْـيا وَالآخِـرَة، اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في ديني وَدُنْـيايَ، وَأهْـلي وَمالـي، اللّهُـمَّ اسْتُـرْ عـوْراتي، وَآمِـنْ رَوْعاتـي، اللّهُـمَّ احْفَظْـني مِن بَـينِ يَدَيَّ، وَمِن خَلْفـي، وَعَن يَمـيني وَعَن شِمـالي، وَمِن فَوْقـي، وَأَعـوذُ بِعَظَمَـتِكَ أَن أُغْـتالَ مِن تَحْتـي.",
      "repeat": 1,
      "benefit": "الدعاء بالعفو والعافية."
    },
    {
      "zikr":
      "يَا حَيُّ يَا قيُّومُ بِرَحْمَتِكَ أسْتَغِيثُ، أصْلِحْ لِي شَأنِي كُلَّهُ، وَلاَ تَكِلْنِي إلَى نَفْسِي طَـرْفَةَ عَيْنٍ.",
      "repeat": 1,
      "benefit": "الدعاء بإصلاح الشأن."
    },
    {
      "zikr":
      "أَصْبَـحْـنا وَأ_صْبَـحْ المُـلكُ للَّهِ رَبِّ العـالَمـين، اللّهُـمَّ إِنِّـي أسْـأَلُـكَ خَـيْرَ هـذا الـيَوْم، فَـتْحَهُ، وَنَصْـرَهُ، وَنـورَهُ وَبَـرَكَتَـهُ، وَهُـداهُ، وَأَعـوذُ بِـكَ مِـنْ شَـرِّ ما فـيهِ وَشَـرِّ ما بَعْـدَه.",
      "repeat": 1,
      "benefit": "الدعاء بخير اليوم."
    },
    {
      "zikr":
      "اللّهُـمَّ عالِـمَ الغَـيْبِ وَالشّـهادَةِ فاطِـرَ السّماواتِ وَالأرْضِ، رَبَّ كـلِّ شَـيءٍ وَمَليـكَه، أَشْهَـدُ أَنْ لا إِلـهَ إِلاّ أَنْت، أَعـوذُ بِكَ مِن شَـرِّ نَفْسـي وَمِن شَـرِّ الشَّيْـطانِ وَشِرْكِهِ، وَأَنْ أَقْتَـرِفَ عَلـى نَفْسـي سوءاً أَوْ أَجُـرَّهُ إِلـى مُسْـلِمٍ.",
      "repeat": 1,
      "benefit": "الدعاء بالاستعاذة من الشرور."
    },
    {
      "zikr":
      "اللَّهُمَّ إِنِّي أَسْأَلُكَ عِلْمًا نَافِعًا، وَرِزْقًا طَيِّبًا، وَعَمَلًا مُتَقَبَّلًا.",
      "repeat": 1,
      "benefit": "الدعاء بالعلم النافع والرزق الطيب."
    },
    {
      "zikr": "أَعـوذُ بِكَلِمـاتِ اللَّـه التّـامّـاتِ مِنْ شَـرِّ ما خَلَـق.",
      "repeat": 3,
      "benefit": "الاستعاذة بكلمات الله التامات."
    },
    {
      "zikr": "اللَّهُمَّ صَلِّ وَسَلِّمْ وَبَارِكْ على نَبِيِّنَا مُحمَّد.",
      "repeat": 10,
      "benefit": "الصلاة على النبي محمد."
    },
    {
      "zikr":
      "أسْتَغْفِرُ اللَّـه العَظِيمَ الَّذِي لاَ إلَهَ إلاَّ هُوَ، الحَيُّ القَيُّومُ، وَأتُوبُ إلَيهِ.",
      "repeat": 3,
      "benefit": "الاستغفار والتوبة."
    },
    {
      "zikr":
      "لَا إلَه إلّا اللَّـه وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْك",
      "repeat": 3,
      "benefit": "الاستغفار والتوبة."},
    {
      "zikr":
      "لَا إلَه إلّا اللَّـه وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءِ قَديرٍ.",
      "repeat": 100,
      "benefit": "التوحيد والثناء على الله."
    },
    {
      "zikr": "سُبْحـانَ اللَّـه وَبِحَمْـدِهِ.",
      "repeat": 100,
      "benefit": "التسبيح بحمد الله."
    },
    {
      "zikr": "أسْتَغْفِـرُ اللَّـه وَأتُـوبُ إلَيْـهِ.",
      "repeat": 100,
      "benefit": "الاستغفار والتوبة."
    },
    {
      "zikr":
      "سُبحانَ اللَّـه والحَمدُ للَّـه ولا إلهَ إلّا اللَّـه واللَّـه أكبَر.",
      "repeat": 100,
      "benefit": "التسبيح والتحميد والتهليل والتكبير."
    }
  ];

  final List<Map<String, dynamic>> _evening_azkar = [
    {
      "zikr":
      "سُورَةُ الإِخْلَاصِ\nبِسْمِ ٱللهِ ٱلرَّحْمَـٰنِ ٱلرَّحِيمِ\nقُلْ هُوَ ٱللهُ أَحَدٌ * ٱللهُ ٱلصَّمَدُ * لَمْ يَلِدْ وَلَمْ يُولَدْ * وَلَمْ يَكُن لَّهُۥ كُفُوًا أَحَدٌ *",
      "repeat": 1,
      "benefit": "قراءة سورة الإخلاص."
    },
    {
      "zikr":
      "سُورَةُ الْفَلَقِ\nبِسْمِ ٱللهِ ٱلرَّحْمَـٰنِ ٱلرَّحِيمِ\nقُلْ أَعُوذُ بِرَبِّ ٱلْفَلَقِ * مِن شَرِّ مَا خَلَقَ * وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ * وَمِن شَرِّ ٱلنَّفَّـٰثَـٰتِ فِى ٱلْعُقَدِ * وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ *",
      "repeat": 1,
      "benefit": "قراءة سورة الفلق."
    },
    {
      "zikr":
      "سُورَةُ النَّاسِ\nبِسْمِ ٱللهِ ٱلرَّحْمَـٰنِ ٱلرَّحِيمِ\nقُلْ أَعُوذُ بِرَبِّ ٱلنَّاسِ * مَلِكِ ٱلنَّاسِ * إِلَـٰهِ ٱلنَّاسِ * مِن شَرِّ ٱلْوَسْوَاسِ ٱلْخَنَّاسِ * ٱلَّذِى يُوَسْوِسُ فِى صُدُورِ ٱلنَّاسِ * مِنَ ٱلْجِنَّةِ وَٱلنَّاسِ *",
      "repeat": 1,
      "benefit": "قراءة سورة الناس."
    },
    {
      "zikr":
      "اللَّهُمَّ بِكَ أَمْسَيْنَا، وَبِكَ أَصْبَحْنَا، وَبِكَ نَحْيَا، وَبِكَ نَمُوتُ وَإِلَـيْكَ المَصِيْر.",
      "repeat": 1,
      "benefit": "الدعاء بالحياة والموت لله."
    },
    {
      "zikr":
      "اللَّهُمَّ أَنْتَ رَبِّي لَّا إِلَهَ إِلَّا أَنْتَ، خَلَقْتَنِي وَأَنَا عَبْدُكَ، وَأَنَا عَلَى عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتُ، أَعُوذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ، أَبُوءُ لَكَ بِنِعْمَتِكَ عَلَيَّ، وَأَبُوءُ بِذَنْبِي فَاغْفِر لِي فَإِنَّهُ لَا يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ.",
      "repeat": 1,
      "benefit": "الدعاء بالاستغفار والتوبة."
    },
    {
      "zikr":
      "اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِي الدُّنْيَا وَالْآخِرَةِ، اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِي دِينِي، وَدُنْيَايَ، وَأَهْلِي، وَمَالِي، اللَّهُمَّ اسْتُرْ عَوْرَاتِي، وَآمِنْ رَوْعَاتِي، اللَّهُمَّ احْفَظْنِي مِنْ بَيْنِ يَدَيَّ، وَمِنْ خَلْفِي، وَعَنْ يَمِينِي، وَعَنْ شِمَالِي، وَمِنْ فَوْقِي، وَأَعُوذُ بِعَظَمَتِكَ أَنْ أُغْتَالَ مِنْ تَحْتِيَ.",
      "repeat": 1,
      "benefit": "الدعاء بالعفو والعافية."
    },
    {
      "zikr":
      "اللَّهُمَّ عَافِـني فِي بَدَنِي، اللَّهُمَّ عَافِـنِي فِي سَمْعِي، اللَّهُمَّ عَافِنِي فِي بَصَرِي، لَا إِلَهَ إلاَّ أَنْتَ. اللَّهُمَّ إِنِّي أَعُوذُبِكَ مِنَ الْكُفْر، وَالفَقْرِ، وَأَعُوذُبِكَ مِنْ عَذَابِ الْقَبْرِ ، لَا إلَهَ إلاَّ أَنْتَ.",
      "repeat": 1,
      "benefit": "الدعاء بالعافية من الشرور."
    },
    {
      "zikr":
      "اللَّهُمَّ أَمْسَيْنَا نُشْهِدُكَ وَنُشْهِدُ حَمَلَةَ عَرْشِكَ وَمَلاَئِكَتَكَ وَجَمِيعَ خَلْقِكَ بِأَنَّكَ الله لاَ إِلَهَ إِلاَّ أَنْتَ وَحْدَكَ لاَ شَرِيكَ لَكَ وَأَنَّ مُحَمَّدًا عَبْدُكَ وَرَسُولُكَ.",
      "repeat": 1,
      "benefit": "الشهادة لله ورسوله."
    },
    {
      "zikr":
      "اللَّهُمَّ مَا أََمْسَ بِي مِنْ نِعْمَةٍ أَوْ بِأَحَدٍ مِنْ خَلْقِكَ فَمِنْكَ وَحْدَكَ لَا شَرِيكَ لَكَ، فَلَكَ الْحَمْدُ وَلَكَ الشُّكْرُ.",
      "repeat": 1,
      "benefit": "الشكر على النعم."
    },
    {
      "zikr":
      "اللَّهُمَّ عَالِمَ الْغَيْبِ وَالشَّهَادَةِ فَاطِرَ السَّماوَاتِ وَالْأَرْضِ، رَبَّ كُلِّ شَيْءٍ وَمَلِيكَهُ، أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا أَنْتَ، أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي، وَمِنْ شَرِّ الشَّيْطَانِ وَشِرْكِهِ، وَأَنْ أَقْتَرِفَ عَلَى نَفْسِي سُوءاً أَوْ أَجُرَّهُ إِلَى مُسْلِمٍ.",
      "repeat": 1,
      "benefit": "الدعاء بالاستعاذة من الشرور."
    },
    {
      "zikr":
      "حَسْبِيَ اللَّهُ لَآ إِلَهَ إِلَّا هُوَ عَلَيْهِ تَوَكَّلْتُ وَهُوَ رَبُّ الْعَرْشِ الْعَظِيمِ.",
      "repeat": 1,
      "benefit": "التوكل على الله."
    },
    {
      "zikr": "أَعُوذُ بِكَلِمَاتِ اللَّهِ التَّامَّاتِ مِنْ شَرِّ مَا خَلَقَ.",
      "repeat": 1,
      "benefit": "الاستعاذة بكلمات الله التامات."
    },
    {
      "zikr":
      "سُبْحَانَ اللَّهِ وَبِحَمْدِهِ عَدَدَ خَلْقِهِ، وَرِضَا نَفْسِهِ، وَزِنَةَ عَرْشِهِ وَمِدَادَ كَلِمَاتِهِ.",
      "repeat": 1,
      "benefit": "التسبيح بحمد الله."
    },
    {
      "zikr":
      "رَضِيتُ باللَّهِ رَبًّا، وَبِالْإِسْلَامِ دِيناً، وَبِمُحَمَّدٍ صَلَى اللَّهُ عَلِيهِ وَسَلَّمَ نَبِيَّاً.",
      "repeat": 1,
      "benefit": "الرضا بالله ربًا وبالإسلام دينًا وبمحمد نبيًا."
    },
    {
      "zikr":
      "بِسْمِ اللَّهِ الَّذِي لَا يَضُرُّ مَعَ اسْمِهِ شَيْءٌ فِي الَْأرْضِ وَلَا فِي السَّمَاءِ وَهُوَ السَّمِيعُ الْعَلِيمُ.",
      "repeat": 1,
      "benefit": "الاستعاذة من الشرور."
    },
    {
      "zikr":
      "يَاحَيُّ، يَا قَيُّومُ، بِرَحْمَتِكَ أَسْتَغِيثُ، أَصْلِحْ لِي شَأْنِي كُلَّهُ، وَلَا تَكِلْنِي إِلَى نَفْسِي طَرْفَةَ عَيْنٍ.",
      "repeat": 1,
      "benefit": "الدعاء بإصلاح الشأن."
    },
    {
      "zikr":
      "أَمْسَيْنَا وَأَمْسَى الْمُلْكُ لِلَّهِ رَبِّ الْعَالَمِينَ اللَّهُمَّ إِنِّي أَسْأَلُكَ خَيْرَ هَذِهِ اللَّيْلَةَ فَتْحَهَا وَنَصْرَهَا وَنُورَهَا وَبَرَكَتَهَا وَهُدَاهَا وَأَعُوذُ بِكَ مِنْ شَرِّ مَا فِيهَا وَشَرِّ مَا بَعْدَهَا.",
      "repeat": 1,
      "benefit": "الدعاء بخير الليل."
    },
    {
      "zikr":
      "اَمْسَيْنَا وَاَمْسَ الْمُلْكُ لِلَّهِ وَالْحَمْدُ لِلَّهِ، لَا إِلَهَ إِلَّّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، رَبِّ أَسْأَلُكَ خَيْرَ مَا فِيْ هَذَا اللَّيْلَةِ وَخَيْرَ مَا بَعْـدَهـا، وَأَعُوْذُ بِكَ مِنْ شَرِّ مَا فِي هَذَا اللَّيْلَةِ وَشَرِّ مَا بَعْـدَهـا، رَبِّ أَعُوْذُ بِكَ مِنَ الْكَسَلِ، وَسُوءِ الْكِبَرِ، رَبِّ أَعُوْذُ بِكَ مِنْ عَذَابٍ فِيْ النَّارِ وَعَذَابٍ فِيْ الْقَبْرِ.",
      "repeat": 1,
      "benefit": "الدعاء بخير الليل والاستعاذة من الشرور."
    },
    {
      "zikr":
      "اللهُ لَا إِلَهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ لَهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ مَنْ ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلَّا بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلَا يُحِيطُونَ بِشَيْءٍ مِنْ عِلْمِهِ إِلَّا بِمَا شَاءَ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ وَلَا يَئُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ.",
      "repeat": 1,
      "benefit": "قراءة آية الكرسي."
    },
    {
      "zikr": "سُبْحَانَ اللَّهِ وَبِحَمْدِهِ.",
      "repeat": 100,
      "benefit": "التسبيح بحمد الله."
    }
  ];

  @override
  Widget build(BuildContext context) {
    return Container(
      decoration: const BoxDecoration(
        image: DecorationImage(
          image: AssetImage("images/masged.jpg"),
          fit: BoxFit.cover,
        ),
      ),
      child: Scaffold(
        backgroundColor: Colors.transparent,
        appBar: AppBar(
          title: const Text(
            'الأذكار',
            style: TextStyle(
              fontSize: 24,
              fontWeight: FontWeight.bold,
            ),
          ),
          backgroundColor: Colors.transparent,
          bottom: PreferredSize(
            preferredSize: const Size.fromHeight(60),
            child: Container(
              margin: const EdgeInsets.symmetric(horizontal: 16),
              padding: const EdgeInsets.all(4),
              decoration: BoxDecoration(
                color: const Color(0xFF99ACA7).withOpacity(0.1),
                borderRadius: BorderRadius.circular(15),
              ),
              child: TabBar(
                controller: _tab_controller,
                indicator: BoxDecoration(
                  color: const Color(0xFF013E2E),
                  borderRadius: BorderRadius.circular(12),
                ),
                labelColor: Colors.white,
                unselectedLabelColor: const Color(0xFF014535),
                tabs: const [
                  Tab(text: 'أذكار الصباح'),
                  Tab(text: 'أذكار المساء'),
                ],
              ),
            ),
          ),
        ),
        body: TabBarView(
          controller: _tab_controller,
          children: [
            ListView(
              padding: const EdgeInsets.all(16),
              children: _morning_azkar.map((zikr) {
                return zikr_card(
                  zikr: zikr['zikr'],
                  repeat: zikr['repeat'],
                  benefit: zikr['benefit'],
                );
              }).toList(),
            ),
            ListView(
              padding: const EdgeInsets.all(16),
              children: _evening_azkar.map((zikr) {
                return zikr_card(
                  zikr: zikr['zikr'],
                  repeat: zikr['repeat'],
                  benefit: zikr['benefit'],
                );
              }).toList(),
            ),
          ],
        ),
      ),
    );
  }
}
